class LessonsModel{

 static List<String> labels = [
    "شرح الدرس الأول",
    "شرح الدرس الثاني",
    "شرح الدرس الثالث",
    "شرح الدرس الرابع",
  ];
 static List<String> captions =[
    "ركز على العناصر الانتقالية. يشرح مفهومها، خواصها الفيزيائية والكيميائية، وأهميتها الصناعية والبيولوجية. كما يتناول توزيعها الإلكتروني وعلاقتها بتعدد حالات الأكسدة.",
    " السبائك. يشرح مفهوم السبيكة، أنواعها، وطرق تكوينها، مع توضيح أهميتها في تحسين خواص المواد. كما يناقش أمثلة على سبائك شائعة مثل البرونز والصلب واستخداماتها العملية.",
    "ركز على العناصر الانتقالية. يشرح مفهومها، خواصها الفيزيائية والكيميائية، وأهميتها الصناعية والبيولوجية. كما يتناول توزيعها الإلكتروني وعلاقتها بتعدد حالات الأكسدة.",
    " السبائك. يشرح مفهوم السبيكة، أنواعها، وطرق تكوينها، مع توضيح أهميتها في تحسين خواص المواد. كما يناقش أمثلة على سبائك شائعة مثل البرونز والصلب واستخداماتها العملية."];



}